<template>
  <Shell>
    <article>
      <h1>Что такое Lorem Ipsum?</h1>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      v
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
      <p>
        Lorem Ipsum - это текст-"рыба", часто используемый
        в печати и вэб-дизайне. Lorem Ipsum является
        стандартной "рыбой" для текстов на латинице с
        начала XVI века. В то время некий безымянный
        печатник создал большую коллекцию размеров и форм
        шрифтов, используя Lorem Ipsum для распечатки
        образцов. Lorem Ipsum не только успешно пережил
        без заметных изменений пять веков, но и перешагнул
        в электронный дизайн. Его популяризации в новое
        время
      </p>
    </article>
  </Shell>





  <div>
  </div>


</template>
<script>
import Shell from "@/components/Shell.vue";
import {useCallcardStore} from "./store/callCardStores.js";
import axios from "axios";

export default {
  name: 'CallCard',
  components: {Shell},
  data() {
    return {
      callcardStore: useCallcardStore(),
    }
  },
  mounted() {
    this.callcardStore.getAll().then(res => {
      console.log('res', res.data);
    })
  }
}
</script>
